#include <stdio.h>
/* Упражнение 1.7. Напишите программу, печатающую значение EOF */
main ()
{
    printf ("EOF = %d\n", EOF);
}
